# -*- coding: utf-8 -*-
'''
Задание 5.3a

Дополнить скрипт из задания 5.3 таким образом, чтобы, в зависимости от выбранного режима,
задавались разные вопросы в запросе о номере VLANа или списка VLANов:
* для access: 'Введите номер VLAN:'
* для trunk: 'Введите разрешенные VLANы:'

Ограничение: Все задания надо выполнять используя только пройденные темы.
То есть эту задачу можно решить без использования условия if и циклов for/while.
'''

access_template = [
    'switchport mode access', 'switchport access vlan {}',
    'switchport nonegotiate', 'spanning-tree portfast',
    'spanning-tree bpduguard enable'
]

trunk_template = [
    'switchport trunk encapsulation dot1q', 'switchport mode trunk',
    'switchport trunk allowed vlan {}'
]


templates = {'access': [access_template, 'Give me a vlan: '], 'trunk': [trunk_template, 'Give me allowed vlans: ']}

int_mode = input('Give me an interface mode: ')
interface = input('Give me a name of interface: ')
vlan = input(templates.get(int_mode)[1])

print('interface ' + interface)
print('\n'.join(templates.get(int_mode)[0]).format(vlan))
